content/post/double-damask.md
+++
title = "Double Damask"
author = ["Alasdair McAndrew"]
date = 2018-04-27
draft = false
+++

This was a comedy sketch initially performed in the revue ["Clowns in
Clover"](<http://www.guidetomusicaltheatre.com/shows%5Fc/clownsclover.htm>) which
had its first performance at the Adelphi Theatre in London on December 1, 1927.
This particular sketch was written by [Dion
Titheradge](<http://en.wikipedia.org/wiki/Dion%5FTitheradge>) and starred the
inimitable [Cicely
Courtneidge](<https://en.wikipedia.org/wiki/Cicely%5FCourtneidge>) as the annoyed
customer Mrs Spooner.  It has been recorded and is available on many different
collections; you can also hear it on
[youtube](<https://www.youtube.com/watch?v=0P8XSUGSR-c>).

I have loved this sketch since I first heard it as a teenager on a three record
collection called something like "Masters of Comedy", being a collection of
classic sketches.  Double Damask has also been performed by Beatrice Lillie, and
you can search for this also on youtube.  For example,
[here](<https://www.youtube.com/watch?v=GiRyqDfNxqU>).  I hope admirers of the
excellent Ms Lillie will not be upset by my saying I far prefer Cicely
Courtneidge, whose superb diction and impeccable comic timing are beyond
reproach.

No doubt the original script is available somewhere, but in the annoying way of
the internet, I couldn't find it.  So here is my transcription of the
Courtneidge version of "Double Damask".

---

**Double Damask**

written by

Dion Titheradge

_Characters:_\\
A customer, Mrs Spooner\\
A shop assistant (unnamed)\\
A manager, Mr Peters

_Scene:_ The linen department of a large store.

MRS SPOONER: I wonder if you could tell me if my order has gone off yet?

ASSISTANT: Not knowing your order, madam, I really couldn't say.

MRS SPOONER: But I was in here an hour ago and gave it to you.

ASSISTANT: What name, madam?

MRS SPOONER: Spooner, Mrs Spooner,

ASSISTANT: Have you an address?

MRS SPOONER: Do I look as if I live in the open air? I gave a large order for
sheets and tablecloths, to be sent to Bacon Villa, Egham.  (pronounced "Eg'm")

ASSISTANT: Eg'm?

MRS SPOONER: I hope I speak plainly: Egg Ham!

ASSISTANT: Oh yes, yes I remember perfectly now, Madam.  Let me see now... no,
your order won't go through until tomorrow morning.  Is there anything further?

MRS SPOONER: Yes, (very quickly) I want two dozen double damask dinner napkins.

ASSISTANT: I beg your pardon?

MRS SPOONER (as quicky as before): I said two dozen double damask dinner napkins.

ASSISTANT: I'm sorry madam, I don't quite catch -

MRS SPOONER: Dinner napkins, man! Dinner napkins!

ASSISTANT: Of course madam.  Plain?

MRS SPOONER: Not plain, double damask.

ASSISTANT: Yes... would you mind repeating your order Madam? I'm not quite sure.

MRS SPOONER: I want two dozen dammle dubbuck; I want two dammle dubb... oh dear,
stupid of me!  I want two dozen dammle dizzick danner nipkins.

ASSISTANT: Danner nipkins Madam?

MRS SPOONER: Yes.

ASSISTANT: You mean dinner napkins.

MRS SPOONER: That's what I said.

ASSISTANT: No, pardon me, Madam, you said danner nipkins!

MRS SPOONER: Don't be ridiculous!  I said dinner napkins, and I meant danner
nipkins.  Nipper dank...you know you're getting me muddled now.

ASSISTANT: I'm sorry Madam.  You want danner nipkins, exactly.  How many?

MRS SPOONER: Two duzzle.

ASSISTANT: Madam?

MRS SPOONER: Oh, gracious, young man - can't you get it right?  I want two dubbin duzzle
damask dinner napkins.

ASSISTANT: Oh no, Madam, not two dubbin - you mean two dozen!

MRS SPOONER: I said two dozen!  Only they must be dammle duzzick!

ASSISTANT: No, we haven't any of that in stock, Madam.

MRS SPOONER (in a tone of complete exasperation): Oh dear, of all the fools!
Can't I find anybody, just anybody with a modicum of intelligence in this store?

ASSISTANT: Well, here is our Mr Peters, Madam. Now perhaps if you ask him he might-

MR PETERS (In an authoritative "we can fix anything" kind of voice): Can I be of
any assistance to you, Madam?

MRS SPOONER: I'm sorry to say that your assistant doesn't appear to speak
English.  I'm giving an order, but it might just as well be in Esperanto for all
he understands.

MR PETERS: Allow me to help you Madam.  You require?

MRS SPOONER: I require (as quickly as before) two dozen double damask dinner napkins.

MR PETERS: I beg pardon, Madam?

MRS SPOONER: Oh heavens - can't you understand?

MR PETERS: Would you mind repeating your order, Madam.

MRS SPOONER: I want two dazzen -

MR PETERS: Two dozen!

MRS SPOONER: I said two dozen!

MR PETERS: Oh no no Madam - no, you said two dazzen.  But I understand perfectly
what you mean.  You mean two dozen; in other words - a double dozen.

MRS SPOONER: That's it! A duzzle dubbin double damask dinner napkins.

MR PETERS: Oh no, pardon me, Madam, pardon me: you mean a double dozen double dummick
dinner napkins.

ASSISTANT: Double damask, sir.

MR PETERS: I said double damask!  It's... dapper ninkins you require, sir.

MRS SPOONER: Please get it right, I want dinner napkins, dinner napkins.

MR PETERS: I beg pardon, Madam. So stupid of me...one gets so confused...  (Laughs)

MRS SPOONER: It is not a laughing matter.

MR PETERS: Of course.  Dipper nankins, madam.

ASSISTANT: Dapper ninkins, sir.

MRS SPOONER: Danner nipkins.

MR PETERS: I understand exactly what Madam wants.  It is two d-d-d-d-..two d- Would you
mind repeating your order please, Madam?

MRS SPOONER: Ohhh, dear.. I want two duzzle dizzen damask dinner dumplings!

MR PETERS: Allow me, Madam, allow me.  The lady requires (quickly) two dubbin
double damask dunner napkins.

ASSISTANT: Dunner napkins sir?

MR PETERS: Certainly!  Two dizzen.

MRS SPOONER: Not two dizzen - I want two dowzen!

MR PETERS: Quite so, Madam, quite so.  If I may say so we're getting a little
bit confused, splitting it up, as it were.  Now, the full order, the full order,
is two dazzen dibble dummisk n'dipper dumkins.

ASSISTANT: Excuse me, sir, you mean two dummen dammle dimmick dizzy napkins.

(The next four four lines are spoken almost on top of each other)

MRS SPOONER: I do not want dizzy napkins, I want two dizzle dammen damask -

MR PETERS: No - two dizzle dammle dizzick!

ASSISTANT: Two duzzle dummuck dummy!

MRS SPOONER: Two damn dizzy diddle dimmer dipkins!

MR PETERS (Shocked): Madam, Madam!  Please, please - your language!

MRS SPOONER: Oh, blast.  Give me twenty four serviettes.

[//]: # "Exported with love from a post written in Org mode"
[//]: # "- https://github.com/kaushalmodi/ox-hugo"
